{
  "users": [
    {
      "email": "email@a.c",
      "password": "$2a$10$DonmYae.niD8JS8n2objSe6wAnOIOIstq1u/QgkRgukAcVBLBrNtu",
      "name": "Abdulrahman Moussa",
      "id": 2
    },
    {
      "email": "e@e.c",
      "password": "$2a$10$94fWtSf4JgXqejhpMbPs3u6kARleauLBYyLAXv/D0wPePVP8p0bpe",
      "name": "Anonymous",
      "id": 3
    },
    {
      "email": "old@g.c",
      "password": "$2a$10$SLtbhQtsHyN8DoSQNdjsGesBOgBl1fD4eUbBH0NyS04zB5wN53HIq",
      "name": "The Old Man",
      "id": 4
    },
    {
      "email": "ghost@g.c",
      "password": "$2a$10$EaXbbM5sdWyqp2C6RzII5OmLCCdgxPADe8v5da45UCrMOqezZk/zK",
      "name": "Ghost Writer",
      "id": 5
    },
    {
      "email": "l@e.c",
      "password": "$2a$10$BUo4ey/U3EOCXbghzgIAye/D46HhOvDLKcSrUiGpwEeQAnmfv1jZC",
      "name": "L L",
      "id": 6
    },
    {
      "email": "ihatesara@g.c",
      "password": "$2a$10$iPy4EaFsEAJUQLbDcyz3FOBd4oBzlLQviDvqWHjeUDoRziyr3Xt0y",
      "name": "I Hate Sara",
      "id": 7
    },
    {
      "email": "kissmyasssouzan@hate.fuck",
      "password": "$2a$10$sTQMLwJSZLICJ1pXjR7L4ugDTnVbSVlcequuBe7gfKVGiDSWmvLK6",
      "name": "Fuck You Souzan",
      "id": 8
    },
    {
      "email": "test@g.c",
      "password": "$2a$10$FJE22gp8lGouVlb/dvoEGeJM9Bkj65qIftZxGfKYeZRZrIIlXvnd2",
      "name": "test",
      "id": 9
    }
  ],
  "posts": [
    {
      "id": "205a6293-6324-4ee4-9e32-6c93fa2f3d03",
      "title": "The Glorious Return of the Floppy Disk: More Than Just a Save Icon",
      "content": "In the age of cloud storage and terabyte drives that fit in your pocket, the floppy disk might seem like an ancient relic—something you'd find in a dusty drawer or as a quirky icon in your favorite software. But the floppy disk was once a cornerstone of personal computing, and its legacy is far more fascinating than just being the \"save\" button.\n\nIntroduced in the 1970s and popularized through the 80s and 90s, floppy disks were the original portable storage solution. At 1.44 MB (for the 3.5-inch version), they seem laughably small by today’s standards—but back then, that was enough to hold entire programs, dozens of documents, or even a basic video game.\n\nWhat made floppies magical wasn’t just their portability—it was the sound they made when you inserted them, the satisfying click of the drive, and the ritual of labeling them with a Sharpie. They represented the early hacker spirit, a time when people traded disks like Pokémon cards, sharing software, games, and secrets in byte-sized packages.\n\nToday, floppies have found new life as retro collectibles. Some artists and hobbyists even use them for digital art canvases or install Linux distros on them just for fun. And believe it or not, some industrial systems—including parts of the U.S. government until recently—still relied on floppy disks because of their reliability and air-gapped security.\n\nThe floppy disk is more than nostalgia—it's a symbol of a simpler, more tactile era of computing. So next time you click that save icon, remember: you’re paying homage to one of the unsung heroes of the digital revolution.\n\nStay retro.",
      "image": "https://images.unsplash.com/photo-1652195019227-4f3d3f599959?q=80&w=2073&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "author": "Abdulrahman Moussa",
      "userId": 2,
      "createdAt": "2025-05-28T10:16:02.325Z",
      "isDeleted": false,
      "comments": [
        {
          "id": "1748433965243",
          "content": "somthing test",
          "userId": "2",
          "userName": "Abdulrahman Moussa",
          "createdAt": "2025-05-28T12:06:05.243Z"
        }
      ]
    },
    {
      "id": "31ec6d8a-b24a-4c21-a186-e9332a20909e",
      "title": "Cassette Tapes: The Analog Heartbeat of the '80s",
      "content": "Before Spotify playlists and MP3 downloads, there was the mixtape—a handcrafted collection of songs recorded onto a humble cassette tape. Born in the 1960s and booming through the '70s and '80s, cassette tapes were more than a music format. They were a cultural statement, a love letter, a rebellion, and sometimes a secret message between friends.\n\nThere was an art to it: waiting by the radio to hit record when your favorite song came on, carefully timing Side A and Side B to maximize the 60 or 90 minutes, and crafting cover art with doodles and tracklists in loopy handwriting. Mixtapes weren't just music—they were memories encoded in magnetic tape.\n\nThe technology was simple but brilliant. A plastic shell, two reels, and a ribbon of magnetic tape capable of capturing voices, songs, and stories. Cassette players were everywhere—in cars, bedrooms, and walkmans clipped to denim jackets. They gave rise to the “personal soundtrack,” where music moved with you, not just around you.\n\nDespite their decline in the digital age, cassette tapes are seeing a resurgence among collectors, indie bands, and nostalgia seekers. Their analog imperfections—hiss, wow, and flutter—are now considered part of their charm. New releases are even dropping on cassette, and old decks are being dusted off with pride.\n\nCassette tapes remind us that music isn’t just something we consume—it's something we feel. And sometimes, the best way to feel it is with a little rewind and a satisfying click.\n\nLong live the mixtape.",
      "image": "https://images.unsplash.com/photo-1524779709304-40b5a3560c60?q=80&w=1976&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "author": "Abdulrahman Moussa",
      "userId": 2,
      "createdAt": "2025-05-28T10:19:21.028Z",
      "isDeleted": false,
      "comments": []
    },
    {
      "id": "5a1c7b58-ebd4-4ec3-9955-522d89bae866",
      "title": "Pixel Art: When Limitations Sparked a Creative Revolution",
      "content": "Before hyper-realistic graphics and ray tracing, game developers had to work with tight restrictions—tiny screens, minimal colors, and limited memory. The result? Pixel art. What began as a necessity in the early days of gaming evolved into a beloved and enduring art form that continues to captivate artists and players alike.\n\nIn the 8-bit and 16-bit eras, pixel art wasn’t just a style—it was the language of gaming. Characters like Mario, Mega Man, and Link were born from grids of tiny squares, each pixel carefully placed to suggest life, motion, and emotion. Developers had to convey entire worlds using just a few colors and a lot of imagination. And it worked.\n\nThere’s something timeless about pixel art. It speaks to a generation that grew up blowing into NES cartridges and watching sprites dance across CRT screens. But it also resonates with younger audiences who appreciate the charm, nostalgia, and aesthetic precision of pixel-based design. Today, indie games like Stardew Valley, Celeste, and Undertale show that pixel art is far from dead—it’s thriving.\n\nWhat’s more amazing is how pixel art has extended beyond gaming. You’ll find it in fashion, animations, NFTs, and even street art. Artists continue to push the boundaries, not in resolution, but in storytelling and emotion within each tiny square.\n\nPixel art reminds us that creativity isn’t about having no limits—it’s about doing something magical within them.\n\nSometimes, less really is more.",
      "image": "https://images.unsplash.com/photo-1628011636812-eb8acf17e7b0?q=80&w=2080&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "author": "Anonymous",
      "userId": 3,
      "createdAt": "2025-05-28T10:21:52.431Z",
      "isDeleted": false,
      "comments": []
    },
    {
      "id": "93f9c63e-83c8-4180-a945-8ba4bd752d5f",
      "title": "The Rotary Phone: When Dialing Meant Something",
      "content": "In today’s world of instant messaging and voice assistants, the rotary phone feels like a relic from another planet. But once upon a time, it was the centerpiece of the home—a solid, mechanical marvel that turned making a phone call into a small ritual.\n\nInvented in the early 20th century and reaching peak popularity in the mid-1900s, rotary phones worked by sending electrical pulses as you spun the dial. Each number had its own rhythm, and frequent callers could recognize a number just by the sound it made. No touchscreens, no contacts list—just a satisfying click-click-click with every digit.\n\nThese phones were built to last. They had real weight, a thick cord you could twirl around your finger, and a bell that rang like it meant something. And because you had to physically dial each number, making a call felt more intentional. You remembered phone numbers. You spoke more thoughtfully. You couldn't text someone \"k.\"\n\nAnd here's the kicker—rotary phones still work. If you plug one into a landline, chances are it’ll ring loud and clear, ready to connect you the old-school way. Some people are even modifying them with Bluetooth or USB connectors, blending vintage charm with modern tech.\n\nThe rotary phone is more than a communication device—it’s a symbol of a slower, more deliberate time. A time when patience was part of the process and hearing someone’s voice meant spinning a circle and waiting for magic to happen.\n\nSo go ahead—give it a spin.",
      "image": "https://plus.unsplash.com/premium_photo-1701760279195-89257eecdda7?q=80&w=1932&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "author": "The Old Man",
      "userId": 4,
      "createdAt": "2025-05-28T10:24:05.228Z",
      "isDeleted": false,
      "comments": []
    },
    {
      "id": "6068fc13-16d1-4f62-b30e-95be765601c7",
      "title": "Arcade Games: The Electric Heartbeat of the '80s",
      "content": "Step into a dark room lit only by neon lights and glowing screens, where the air hums with digital bleeps and the clatter of buttons. Welcome to the golden age of arcade games—a time when entertainment meant standing shoulder to shoulder with strangers, quarters in hand, chasing high scores and pixelated glory.\n\nIn the late '70s through the '80s, arcades were more than just places to play—they were social hubs, battlegrounds, and shrines to cutting-edge technology. Games like Pac-Man, Donkey Kong, Galaga, and Street Fighter II didn’t just entertain—they defined an era. With bright graphics, pulsing soundtracks, and punishing difficulty, arcade machines challenged players to master patterns, perfect timing, and lightning reflexes.\n\nThere was nothing quite like the thrill of seeing your initials on the high score list, or the adrenaline rush of a crowd forming behind you during a tense match. Each cabinet was a doorway into a different world, and every quarter was a ticket to escape.\n\nEven today, arcades are alive—not just in retro bars and nostalgic collections, but in the DNA of modern gaming. Indie developers pay homage to arcade aesthetics, esports echo the competitive spirit, and titles like Cuphead and Geometry Wars revive the old-school challenge in new-school forms.\n\nArcade games remind us of a time when graphics weren’t everything, but fun was everything. When “just one more game” meant a pocketful of coins and a night to remember.\n\nInsert coin to continue.",
      "image": "https://images.unsplash.com/photo-1598894159088-42210e20d2d6?q=80&w=1947&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "author": "The Old Man",
      "userId": 4,
      "createdAt": "2025-05-28T10:25:18.044Z",
      "isDeleted": false,
      "comments": []
    },
    {
      "id": "c1acc044-4ad0-4fa8-a3e3-f36c47c6dc99",
      "title": "Polybius: The Creepy Legend of the Arcade Game That Never Was",
      "content": "In the shadowy corners of retro gaming history lies one of the creepiest urban legends to ever haunt the arcade scene: Polybius. According to the myth, it was a mysterious game that appeared in a few arcades in Portland, Oregon, in the early 1980s. Players who dared to try it reported strange effects—nightmares, memory loss, seizures, and even paranoia.\n\nThe cabinet was said to be sleek and all black, with no flashy artwork—just the name Polybius in glowing green letters. The gameplay? Descriptions vary, but it was supposedly a fast-paced puzzle-shooter hybrid with swirling visuals and subliminal messages woven into the screen. Some say it was mesmerizing—others claim it was mind-breaking.\n\nThen, just as suddenly as it appeared, Polybius vanished. Arcade owners claimed the machines were removed overnight by men in black suits. Players who had tried the game couldn’t remember much, and no physical unit was ever confirmed to exist.\n\nWas it a government experiment in psychological manipulation? A CIA mind-control project? Or just a hoax born from the collective imagination of early internet forums?\n\nNo one knows for sure. But the legend refuses to die. Over the years, fake cabinets, tribute games, and creepy recreations have surfaced—feeding the myth and keeping the story alive in the minds of gamers and conspiracy theorists alike.\n\nWhether real or imagined, Polybius is the perfect ghost story for arcade lovers. A digital phantom that blurs the line between entertainment and something much darker.\n\nPlay… if you dare.",
      "image": "https://upload.wikimedia.org/wikipedia/en/8/8c/Polybius_2017_cover_art.jpg?20171230133013",
      "author": "Ghost Writer",
      "userId": 5,
      "isDeleted": false,
      "editedAt": "2025-05-28T10:37:48.899Z",
      "comments": []
    },
    {
      "id": "3565541f-345a-40ea-b931-8a133824453d",
      "title": "The Max Headroom Incident: A Broadcast Hijack Straight Out of a Nightmare",
      "content": "On the night of November 22, 1987, Chicago television viewers witnessed one of the most bizarre and unsettling moments in broadcast history. During a regular evening newscast on WGN, the signal was suddenly hijacked. The screen cut to static, then to a man wearing a rubber Max Headroom mask—a parody of the popular 1980s AI TV character. What followed was a cryptic, creepy display that left viewers—and authorities—shocked.\n\nThere was no explanation, no motive. Just a distorted figure rocking back and forth in front of a spinning metal background, speaking in garbled nonsense and cryptic phrases like “They're coming to get me!” and “My brother is wearing the other glove.” His voice was distorted, and his movements jerky and erratic. It was surreal, unnerving, and completely unexpected.\n\nMinutes later, the signal returned to normal. But just a couple hours later, it happened again—this time during an episode of Doctor Who on PBS. The hijacker returned, this time holding objects, quoting old commercials, and ending the transmission with a chilling scene: someone spanking the masked figure with a flyswatter while he screamed and laughed.\n\nDespite an investigation by the FCC and FBI, the perpetrators were never caught. The technology needed to override a broadcast in the 1980s wasn’t easily accessible, suggesting the work of someone with serious technical know-how—and a twisted imagination.\n\nTo this day, the Max Headroom incident remains one of the most mysterious and disturbing unsolved media crimes in history. It’s a glitch in the polished veneer of 1980s TV—a reminder that even in an age of innocence and analog charm, the weird and the eerie could break through the static.\n\nAnd just like that... he was gone.",
      "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTv_OJ7fLxJMVjkPYA7CEErhnIMj5nP2lwwaF7LTylqojA7CbNuNdxkr-mbTX-XGjb68qw&usqp=CAU",
      "author": "Ghost Writer",
      "userId": 5,
      "isDeleted": false,
      "editedAt": "2025-05-28T10:36:18.594Z",
      "comments": [
        {
          "id": "1748434019621",
          "content": "i hate the matrix",
          "userId": "2",
          "userName": "Abdulrahman Moussa",
          "createdAt": "2025-05-28T12:06:59.621Z"
        }
      ]
    },
    {
      "id": 1748439284342,
      "title": "TV Static at Midnight: The Eerie Silence of the Dead Air Era",
      "content": "Before 24/7 programming and streaming took over, television in the '80s and early '90s had an end. Literally. At a certain hour—usually around midnight or shortly after—broadcasts would stop. The final moments were strangely ceremonial: a national anthem, a station identification screen… and then, nothing but static.\n\nThat sound. That unsettling, endless shhhhhh. To a child awake past bedtime, or a night owl alone in the dark, it wasn’t just noise—it was ominous. The screen, once alive with sitcoms and cartoons, turned into a flickering snowstorm of black and white pixels, whispering with electrical chaos. The living room felt colder. Time felt slower.\n\nEven creepier? If you left the TV on, sometimes it wasn’t just static. Occasionally, it might show color bars with a high-pitched tone, a test pattern with an unsettling stillness, or emergency broadcast tests with robotic voices declaring, “This is only a test.” As a kid, that line alone was enough to send a chill down your spine.\n\nSome urban legends even grew out of this eerie phenomenon. Tales of ghostly faces appearing in the static, strange messages hidden in the noise, or voices that weren’t supposed to be there. It was the perfect backdrop for unease—an empty stage where imagination ran wild.\n\nTV static isn’t scary because of what it shows. It’s scary because of what it doesn’t. It’s the absence of signal, of comfort, of control. A blank screen that stares back.\n\nIn today’s world of constant content, that kind of dead air no longer exists. But for those who grew up in the analog era, the memory of that midnight static still hums in the back of their minds—like a ghost waiting for a signal.",
      "image": "",
      "author": "L L",
      "userId": 6,
      "createdAt": "2025-05-28T13:34:44.342Z",
      "isDeleted": false,
      "comments": [
        {
          "id": "1748441452819",
          "content": "\"\"\"\"\"\"\"\"\"\"\"\"",
          "userId": "8",
          "userName": "Fuck You Souzan",
          "createdAt": "2025-05-28T14:10:52.819Z"
        }
      ]
    },
    {
      "id": 1748439396542,
      "title": "VHS Tapes: Rewinding Time, One Tape at a Tim",
      "content": "There was a time—before Netflix queues, digital libraries, and “skip intro” buttons—when watching a movie at home felt like a small event. You didn’t click play. You popped in a tape. VHS, short for Video Home System, was the dominant force in home entertainment from the late 1970s through the 1990s. For two glorious decades, the chunky black cassette was the undisputed king of the living room.\n\nWalking into a video rental store was an experience in itself. Rows and rows of colorful boxes with dramatic cover art and bold fonts stretched as far as the eye could see. Horror movies had the bloodiest artwork. Action movies showcased explosions and muscle-bound heroes. Comedies featured exaggerated faces frozen in a moment of mayhem. You judged a movie by its cover, and half the fun was picking the perfect Friday night flick.\n\nVHS tapes weren’t perfect—far from it. The video quality was grainy, the tracking needed adjustment, and if you didn’t rewind the tape after watching, you earned the scorn of every future viewer (and sometimes, a fee from the video store). But all of these quirks made the experience feel more personal. The physicality of inserting a tape, the mechanical whirring as it played, and the satisfying clunk when you hit stop—these moments created a tangible connection to the media.\n\nEvery VHS tape had character. Some had rental stickers from long-defunct stores, handwritten labels, or warbly sound from being played one too many times. Bootleg copies of movies passed from friend to friend became cherished possessions. Tapes recorded from TV—commercials and all—became accidental time capsules, preserving not just the movie, but the era it came from.\n\nLet’s not forget the commercials either. If you grew up watching tapes from the '80s or '90s, you probably remember the unforgettable warning: “You wouldn’t steal a car... you wouldn’t steal a handbag…”—a PSA turned meme in the streaming age. Or the classic “Coming Soon to Home Video” bumpers that made even the previews feel special.\n\nAnd then there was the shelf. That towering shelf full of tapes that every family had. A messy, beloved collection of Disney classics, late-night action flicks, and obscure documentaries taped off PBS. Organizing it was an art; finding that one tape with your favorite cartoon episode was a treasure hunt. When friends came over, you proudly showed off your collection like a badge of honor.\n\nEventually, DVD arrived. Then Blu-ray. Then streaming. VHS tapes began to disappear—slowly at first, then all at once. Rental stores closed, tapes were boxed up or thrown away, and the humble VCR became a forgotten appliance. But a funny thing happened: people started to miss them.\n\nNow, VHS is back in a niche but passionate way. Collectors trade rare tapes online. Artists create custom VHS-style covers for modern movies. Some indie filmmakers even release their work on tape, just for the aesthetic. Why? Because VHS isn’t just about watching a movie—it’s about how it felt to watch one.\n\nIt’s about walking to the store, picking a tape, and making it a whole event. It’s about the grain, the rewind, the physical memory. VHS tapes didn’t just hold films—they held moments.\n\nSo here’s to the humble VHS. Rewinder of time, preserver of memories, and a true retro icon. Be kind, rewind—and never forget what it was like to press play.",
      "image": "https://images.unsplash.com/photo-1636750570049-aec176ca3784?q=80&w=1964&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "author": "L L",
      "userId": 6,
      "createdAt": "2025-05-28T13:36:36.542Z",
      "isDeleted": false,
      "comments": []
    },
    {
      "id": 1748439578267,
      "title": "Sidewalk Surfers: The Wild Rise of Skateboarding in the 1970s",
      "content": "Before it was a billion-dollar industry, before the X Games, and way before Tony Hawk was a household name, skateboarding was something raw, rebellious, and utterly improvised. And nowhere was that truer than in the 1970s—a decade that took the humble sidewalk toy of the ‘60s and transformed it into a full-blown cultural phenomenon.\n\nIn the early 1970s, skateboarding was still finding its identity. The boards were narrow, the wheels were made of clay (yes, clay), and most of the tricks involved simply staying upright. But things changed dramatically in 1973 with the invention of urethane wheels. Suddenly, skateboards had grip, speed, and smoothness. Riding felt more like surfing on land—and that’s exactly how many early skaters described it.\n\nEnter the Z-Boys: a group of young surfers from Dogtown (a gritty stretch of Santa Monica and Venice Beach, California) who brought a new style and attitude to skating. When the waves were flat, they took to the streets and schoolyards, carving deep turns like they were riding a wave. But it wasn’t until California’s drought struck in the mid-70s that the true revolution began.\n\nEmpty swimming pools—drained to conserve water—became the new playgrounds. These concrete bowls were perfect for aggressive, flowing moves. The Z-Boys dove in headfirst, literally skating the vertical walls, pushing limits, and unintentionally inventing what we now call vert skating. The photos of Jay Adams, Tony Alva, and Stacy Peralta frozen mid-air in backyard pools are now iconic. Back then, they were just kids looking for something new to conquer.\n\nThe gear was simple: flat wooden boards with rounded noses, wide trucks, and those beautiful urethane wheels. Helmets and pads were rare—if used at all. Road rash was a rite of passage. What mattered wasn’t safety—it was style. How low could you crouch? How fast could you go? Could you make the turn without bailing?\n\nSkating in the '70s wasn’t clean. It was gritty, sun-drenched, and a little dangerous. It didn’t care about rules or regulations. Cops would chase kids off private property. Schools banned skateboarding. But that only made it cooler. To ride was to rebel.\n\nMagazines like Skateboarder and homemade VHS tapes helped spread the movement beyond California. By the end of the decade, skateboarding competitions were popping up everywhere. Brands started forming. New trick names were coined. And while it would rise and fall in popularity through the years, the soul of the sport—the defiance, the creativity, the freedom—was born right there in the '70s.\n\nSo the next time you see someone carving a bowl or bombing a hill, remember: they’re riding in the tracks of those first sidewalk surfers. No skateparks, no sponsors—just sunburned kids, empty pools, and a dream to fly.\n\nThe 1970s didn’t just invent modern skateboarding. It defined its attitude.",
      "image": "https://images.unsplash.com/photo-1622553683138-a9507ec42448?w=600&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8N3x8c2thdGVib2FyZCUyMHJldHJvfGVufDB8fDB8fHww",
      "author": "I Hate Sara",
      "userId": 7,
      "createdAt": "2025-05-28T13:39:38.267Z",
      "isDeleted": false,
      "comments": []
    },
    {
      "id": 1748439786462,
      "title": "The Summer We Never Had: A Love Story That Could’ve Been an ’80s Class",
      "content": "Imagine this: It’s 1985. Big hair is in, cassette mixtapes are currency, and movie theaters are packed with action heroes and teen comedies. But nestled between the explosions and prom-night plotlines, there almost was another kind of movie. A quieter, bittersweet film about love, timing, and growing up. Something like a soft punch to the heart. Something like 500 Days of Summer—if it had been made a quarter-century earlier.\n\nLet’s call it “That Summer With Elise.”\n\nIt’s not your typical boy-meets-girl story. The lead, Daniel, isn’t a jock or a rocker. He’s a wide-eyed dreamer in his early 20s, working at a small record store in San Francisco. He believes in signs, fate, and love at first mixtape. Enter Elise—a girl with a Walkman, a sarcastic smile, and a mysterious past. She doesn’t believe in fate. She doesn’t even believe in love. Not like Daniel does.\n\nThey meet. They talk about The Smiths. They share a milkshake. They walk the foggy streets of the city at night, talking about favorite lyrics and childhood dreams. It’s not flashy. It’s not perfect. But for Daniel, it feels like magic.\n\nAnd just like that—it ends.\n\nNo grand betrayal. No cheating. Just life.\n\nElise wasn’t ready. Daniel thought he was. And the summer they shared becomes a polaroid in his mind—bright, a little overexposed, and fading with time.\n\nIn the movie, the story isn’t told in order. It jumps around—from their first touch to their last conversation, from laughter to heartbreak to hope again. The kind of storytelling that was rare in the '80s, when love stories had tidy endings and heartbreak was just a plot point to overcome.\n\nThat Summer With Elise never existed, of course. But it could have. And if it had, it might’ve changed the way a whole generation thought about love. It would’ve shown that some people come into your life to teach you something—not to stay forever. That love isn’t always about happy endings. Sometimes, it’s just about the middle.\n\nThe soundtrack? Pure perfection. The Cure. Echo & the Bunnymen. Kate Bush. The kind of music that aches and dances at the same time. The kind of songs you’d rewind over and over, hoping they’d reveal some hidden truth.\n\nMaybe it wouldn’t have won an Oscar. Maybe it would’ve been a quiet box-office blip between Back to the Future and The Breakfast Club. But for the right kind of viewer—the ones who loved a little too hard, hoped a little too much, and remembered every small detail of a fading love—it would’ve been unforgettable.\n\nIn an alternate 1980s, That Summer With Elise sits on a dusty VHS shelf somewhere. A cult classic. A love story that doesn’t try to fix you—just understands you.\n\nAnd maybe, just maybe, that’s enough.",
      "image": "https://plus.unsplash.com/premium_photo-1725075084525-9ab65e574f2f?w=600&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8NXx8YnJva2VuJTIwaGVhcnR8ZW58MHx8MHx8fDA%3D",
      "author": "Fuck You Souzan",
      "userId": 8,
      "createdAt": "2025-05-28T13:43:06.462Z",
      "isDeleted": false,
      "comments": [
        {
          "id": "1748441517090",
          "content": "i will search for you my love :````(",
          "userId": "8",
          "userName": "Fuck You Souzan",
          "createdAt": "2025-05-28T14:11:57.090Z"
        }
      ]
    },
    {
      "id": 1748618636980,
      "title": "test",
      "content": "t",
      "image": "",
      "author": "test",
      "userId": 9,
      "createdAt": "2025-05-30T15:23:56.981Z",
      "isDeleted": true,
      "comments": [],
      "deletedAt": "2025-05-30T15:24:32.876Z"
    },
    {
      "id": 1748618650309,
      "title": "dsfsdf",
      "content": "sdfsdf",
      "image": "",
      "author": "test",
      "userId": 9,
      "createdAt": "2025-05-30T15:24:10.309Z",
      "isDeleted": true,
      "comments": [],
      "deletedAt": "2025-05-30T15:24:27.109Z"
    },
    {
      "id": 1748618683456,
      "title": "sadasd",
      "content": "asdsad",
      "image": "",
      "author": "test",
      "userId": 9,
      "createdAt": "2025-05-30T15:24:43.456Z",
      "isDeleted": true,
      "comments": [],
      "deletedAt": "2025-05-30T15:24:49.981Z"
    },
    {
      "id": 1748621653579,
      "title": "vc dfv",
      "content": "dc fd c",
      "image": "",
      "author": "test",
      "userId": 9,
      "createdAt": "2025-05-30T16:14:13.579Z",
      "isDeleted": true,
      "comments": [],
      "deletedAt": "2025-05-30T16:14:21.710Z"
    }
  ]
}